--- Inspecting model.h5 ---
Loaded successfully.
Input shape: (None, 64, 64, 3)
Output shape: (None, 29)
Model Config:
{
  "name": "sequential",
  "trainable": true,
  "dtype": {
    "module": "keras",
    "class_name": "DTypePolicy",
    "config": {
      "name": "float32"
    },
    "registered_name": null
  },
  "layers": [
    {
      "module": "keras.layers",
      "class_name": "InputLayer",
      "config": {
        "batch_shape": [
          null,
          64,
          64,
          3
        ],
        "dtype": "float32",
        "sparse": false,
        "ragged": false,
        "name": "input_layer",
        "optional": false
      },
      "registered_name": null
    },
    {
      "module": "keras.layers",
      "class_name": "Conv2D",
      "config": {
        "name": "conv2d",
        "trainable": true,
        "dtype": {
          "module": "keras",
          "class_name": "DTypePolicy",
          "config": {
            "name": "float32"
          },
          "registered_name": null
        },
        "filters": 32,
        "kernel_size": [
          3,
          3
        ],
        "strides": [
          1,
          1
        ],
        "padding": "valid",
        "data_format": "channels_last",
        "dilation_rate": [
          1,
          1
        ],
        "groups": 1,
        "activation": "relu",
        "use_bias": true,
        "kernel_initializer": {
          "module": "keras.initializers",
          "class_name": "GlorotUniform",
          "config": {
            "seed": null
          },
          "registered_name": null
        },
        "bias_initializer": {
          "module": "keras.initializers",
          "class_name": "Zeros",
          "config": {},
          "registered_name": null
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null
      },
      "registered_name": null,
      "build_config": {
        "input_shape": [
          null,
          64,
          64,
          3
        ]
      }
    },
    {
      "module": "keras.layers",
      "class_name": "MaxPooling2D",
      "config": {
        "name": "max_pooling2d",
        "trainable": true,
        "dtype": {
          "module": "keras",
          "class_name": "DTypePolicy",
          "config": {
            "name": "float32"
          },
          "registered_name": null
        },
        "pool_size": [
          2,
          2
        ],
        "padding": "valid",
        "strides": [
          2,
          2
        ],
        "data_format": "channels_last"
      },
      "registered_name": null
    },
    {
      "module": "keras.layers",
      "class_name": "Conv2D",
      "config": {
        "name": "conv2d_1",
        "trainable": true,
        "dtype": {
          "module": "keras",
          "class_name": "DTypePolicy",
          "config": {
            "name": "float32"
          },
          "registered_name": null
        },
        "filters": 64,
        "kernel_size": [
          3,
          3
        ],
        "strides": [
          1,
          1
        ],
        "padding": "valid",
        "data_format": "channels_last",
        "dilation_rate": [
          1,
          1
        ],
        "groups": 1,
        "activation": "relu",
        "use_bias": true,
        "kernel_initializer": {
          "module": "keras.initializers",
          "class_name": "GlorotUniform",
          "config": {
            "seed": null
          },
          "registered_name": null
        },
        "bias_initializer": {
          "module": "keras.initializers",
          "class_name": "Zeros",
          "config": {},
          "registered_name": null
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null
      },
      "registered_name": null,
      "build_config": {
        "input_shape": [
          null,
          31,
          31,
          32
        ]
      }
    },
    {
      "module": "keras.layers",
      "class_name": "MaxPooling2D",
      "config": {
        "name": "max_pooling2d_1",
        "trainable": true,
        "dtype": {
          "module": "keras",
          "class_name": "DTypePolicy",
          "config": {
            "name": "float32"
          },
          "registered_name": null
        },
        "pool_size": [
          2,
          2
        ],
        "padding": "valid",
        "strides": [
          2,
          2
        ],
        "data_format": "channels_last"
      },
      "registered_name": null
    },
    {
      "module": "keras.layers",
      "class_name": "Conv2D",
      "config": {
        "name": "conv2d_2",
        "trainable": true,
        "dtype": {
          "module": "keras",
          "class_name": "DTypePolicy",
          "config": {
            "name": "float32"
          },
          "registered_name": null
        },
        "filters": 128,
        "kernel_size": [
          3,
          3
        ],
        "strides": [
          1,
          1
        ],
        "padding": "valid",
        "data_format": "channels_last",
        "dilation_rate": [
          1,
          1
        ],
        "groups": 1,
        "activation": "relu",
        "use_bias": true,
        "kernel_initializer": {
          "module": "keras.initializers",
          "class_name": "GlorotUniform",
          "config": {
            "seed": null
          },
          "registered_name": null
        },
        "bias_initializer": {
          "module": "keras.initializers",
          "class_name": "Zeros",
          "config": {},
          "registered_name": null
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null
      },
      "registered_name": null,
      "build_config": {
        "input_shape": [
          null,
          14,
          14,
          64
        ]
      }
    },
    {
      "module": "keras.layers",
      "class_name": "MaxPooling2D",
      "config": {
        "name": "max_pooling2d_2",
        "trainable": true,
        "dtype": {
          "module": "keras",
          "class_name": "DTypePolicy",
          "config": {
            "name": "float32"
          },
          "registered_name": null
        },
        "pool_size": [
          2,
          2
        ],
        "padding": "valid",
        "strides": [
          2,
          2
        ],
        "data_format": "channels_last"
      },
      "registered_name": null
    },
    {
      "module": "keras.layers",
      "class_name": "Flatten",
      "config": {
        "name": "flatten",
        "trainable": true,
        "dtype": {
          "module": "keras",
          "class_name": "DTypePolicy",
          "config": {
            "name": "float32"
          },
          "registered_name": null
        },
        "data_format": "channels_last"
      },
      "registered_name": null,
      "build_config": {
        "input_shape": [
          null,
          6,
          6,
          128
        ]
      }
    },
    {
      "module": "keras.layers",
      "class_name": "Dense",
      "config": {
        "name": "dense",
        "trainable": true,
        "dtype": {
          "module": "keras",
          "class_name": "DTypePolicy",
          "config": {
            "name": "float32"
          },
          "registered_name": null
        },
        "units": 256,
        "activation": "relu",
        "use_bias": true,
        "kernel_initializer": {
          "module": "keras.initializers",
          "class_name": "GlorotUniform",
          "config": {
            "seed": null
          },
          "registered_name": null
        },
        "bias_initializer": {
          "module": "keras.initializers",
          "class_name": "Zeros",
          "config": {},
          "registered_name": null
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null,
        "quantization_config": null
      },
      "registered_name": null,
      "build_config": {
        "input_shape": [
          null,
          4608
        ]
      }
    },
    {
      "module": "keras.layers",
      "class_name": "Dropout",
      "config": {
        "name": "dropout",
        "trainable": true,
        "dtype": {
          "module": "keras",
          "class_name": "DTypePolicy",
          "config": {
            "name": "float32"
          },
          "registered_name": null
        },
        "rate": 0.5,
        "seed": null,
        "noise_shape": null
      },
      "registered_name": null
    },
    {
      "module": "keras.layers",
      "class_name": "Dense",
      "config": {
        "name": "dense_1",
        "trainable": true,
        "dtype": {
          "module": "keras",
          "class_name": "DTypePolicy",
          "config": {
            "name": "float32"
          },
          "registered_name": null
        },
        "units": 29,
        "activation": "softmax",
        "use_bias": true,
        "kernel_initializer": {
          "module": "keras.initializers",
          "class_name": "GlorotUniform",
          "config": {
            "seed": null
          },
          "registered_name": null
        },
        "bias_initializer": {
          "module": "keras.initializers",
          "class_name": "Zeros",
          "config": {},
          "registered_name": null
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null,
        "quantization_config": null
      },
      "registered_name": null,
      "build_config": {
        "input_shape": [
          null,
          256
        ]
      }
    }
  ],
  "build_input_shape": [
    null,
    64,
    64,
    3
  ]
}

--- Inspecting model.h5.bak ---
Error loading model.h5.bak:
Traceback (most recent call last):
  File "C:\Users\chaud\Downloads\Ishario\Ishario\inspect_model2.py", line 22, in load_with_compat
    return tf.keras.models.load_model(model_path, compile=False)
           ~~~~~~~~~~~~~~~~~~~~~~~~~~^^^^^^^^^^^^^^^^^^^^^^^^^^^
  File "C:\Users\chaud\AppData\Local\Programs\Python\Python313\Lib\site-packages\keras\src\saving\saving_api.py", line 209, in load_model
    raise ValueError(
    ...<11 lines>...
    )
ValueError: File format not supported: filepath=model.h5.bak. Keras 3 only supports V3 `.keras` files and legacy H5 format files (`.h5` extension). Note that the legacy SavedModel format is not supported by `load_model()` in Keras 3. In order to reload a TensorFlow SavedModel as an inference-only layer in Keras 3, use `keras.layers.TFSMLayer(model.h5.bak, call_endpoint='serving_default')` (note that your `call_endpoint` might have a different name).

During handling of the above exception, another exception occurred:

Traceback (most recent call last):
  File "C:\Users\chaud\Downloads\Ishario\Ishario\inspect_model2.py", line 52, in <module>
    model = load_with_compat(path)
  File "C:\Users\chaud\Downloads\Ishario\Ishario\inspect_model2.py", line 29, in load_with_compat
    with h5py.File(model_path, "r") as handle:
         ~~~~~~~~~^^^^^^^^^^^^^^^^^
  File "C:\Users\chaud\AppData\Local\Programs\Python\Python313\Lib\site-packages\h5py\_hl\files.py", line 564, in __init__
    fid = make_fid(name, mode, userblock_size, fapl, fcpl, swmr=swmr)
  File "C:\Users\chaud\AppData\Local\Programs\Python\Python313\Lib\site-packages\h5py\_hl\files.py", line 238, in make_fid
    fid = h5f.open(name, flags, fapl=fapl)
  File "h5py/_objects.pyx", line 56, in h5py._objects.with_phil.wrapper
  File "h5py/_objects.pyx", line 57, in h5py._objects.with_phil.wrapper
  File "h5py/h5f.pyx", line 102, in h5py.h5f.open
OSError: Unable to synchronously open file (file signature not found)


